package com.cn.wang.zl.wangmyappkotlin.bean

/**
 * Created by hahaha on 2017/3/6.
 * 文章视频bean
 */

class CMSBean {

    /**
     * posts : [{"id":19,
     * "uuid":"09aadcbc-a72b-49a1-a32f-48c64e276411",
     * "title":"你到底胖不胖？",
     * "slug":"fat-how",
     * "markdown":"\n![](/content/images/2017/03/-----2017-03-03---4.13.01.png)\n\n从体内脂肪角度说，还有一个分布的问题，腹部脂肪的堆积对人体有更多的危害，而臀部脂肪增加对健康的影响相对小一点。\n腰围是取被测者髂前上嵴和第十二肋下缘连线中点，水平位绕腹一周，皮尺应紧贴软组织，但不压迫，测量值精确到0.1cm。
     * 对于多数人讲，理想的腰围，男性应在85cm、女性应在80cm以下。 \n\n![](/content/images/2017/03/4DA096D4751172EC3FD6BB55122707B6-2.jpg)\n*腰围(WC)的重要性： 不同人群中，
     * 与腰围相关的疾病危险性不同。例如，南亚人(印度)的腹部脂肪相当高，腰围大，以WHO的BMI标准来判定时，他们并不肥胖，但是实际上，他们患肥胖相关疾病的危险性非常高。说明对亚太地区的人来说腰围在衡量肥胖相关疾病时是非常有用的指标。
     * *\n  \n**腰围减少时，即使体重没有改变，也可明显减低肥胖相关疾病的危险性**\n\n腰臀比   腰臀比（Waist-hip Ratio, WHR）就是指腰围和臀围的比值。臀围反映髋部骨骼和肌肉的发育情况。测量臀围时，被测者两腿并拢直立，两臂自然下垂，
     * 皮尺水平放在前面的耻骨联合和背后臀大肌最凸处，环绕一圈即得臀围值（图1）。由于脂肪无论堆积在腰腹或内脏，都是难以直接测量的，所以，腰臀比和腰围一样就成了间接反映这类肥胖的最好指标之一。腰臀比值越大，腰腹或内脏就有可能堆积更多
     * 的脂肪。因此，腰臀比可预测心血管疾病、糖尿病和乳腺癌的发生危险。\n\n理想的腰臀比例最小值应该是多少，目前还没有定论。但是，理想的腰臀比例最大值是多少，已经得到了众多专家的确认。如果是女性，理想的腰臀比例大约在0.67～0.80之间。
     * 如果是男性，这一比例大约在0.85～0.9之间。\n关注腰臀比例，能让你随时了解自己的健康状态，还可以给自己建立一个警戒线，是个很有效的健康指标。一旦腰臀比例过大，也就意味着健康风险的加大。糖尿病、高血压就会很容易找上门来；对于男人
     * 来说，还更容易患上心脏病。\n一般来讲，脂肪堆积在腰腹部比堆积在大腿和臀部，对身体的危害要大得多。腰腹部肥胖很容易导致糖尿病、高血压、冠心病、中风和高脂血症等疾病的发生，这就是人们常说的\u201c腰带长，寿命短\u201d的原因所在，
     * 因此说腰围臀围比是健康风向标，但是体重指数只能看作是对体重及相关健康隐患的粗略测算。\n\n![](/content/images/2017/03/ddd.png)\n\n美国运动医学会（ACSM）在1997年提出，男性WHR>0.95或者女性WHR>0.86，都会加大某些疾病的风险，
     * 而和我们地缘更近的澳大利亚健康部提出，男性WHR>1或女性WHR>0.85则为高腰臀围比。目前，我国男性WHR≥0.9、女性WHR≥0.8即为异常。WHR是描述脂肪类型的指标，高者多为向心性脂肪分布，低者多为全身性脂肪分布。\n\n**生理或医学意义**\n\n
     * 当男性WHR大于0.9，女性WHR大于0.8，可诊断为中心性肥胖。 但其分界值随年龄、性别、人种不同而异。\n\n腰臀比是早期研究中预测肥胖的指标。比值越小，说明越健康。这是预测一个人是否肥胖及是否面临患心脏病风险的较佳方法，腰围尺寸大，
     * 表明脂肪存在于腹部，是危险较大的信号;而一个人臀围大，表明其下身肌肉发达，对人的健康有益。\n\n全身胖的人相对健康一些，四肢纤细但拥有啤酒肚者最危险。从对血管、血脂和动脉闭塞的影响来看，累积在腰部的脂肪，比大腿和臀部脂肪对健康
     * 的影响更大。腰部脂肪会破坏胰岛素系统，而且腰部脂肪的新陈代谢相当快，还会产生不同的激素，导致糖尿病、高血压、高血脂等病症。另外，腰部脂肪还会导致肝肥大，使它无法发挥正常功能。\n\n![](/content/images/2017/03/fadfccd351e7729de2d15cc063c96f6f.jpg)\n\n运动是减少脂肪的最佳方法，
     * 同时还可以增强下肢肌肉;而节食不能有效改变腰臀比。\n\n![](/content/images/2017/03/en-d-2.jpg)\n![](/content/images/2017/03/--2.jpg)\n",
     * "mobiledoc":null,
     * "html":"
     *
     *<img src=\"/content/images/2017/03/-----2017-03-03---4.13.01.png\" alt=\"\"></img><\/p>\n\n
     *
     *从体内脂肪角度说，还有一个分布的问题，腹部脂肪的堆积对人体有更多的危害，而臀部脂肪增加对健康的影响相对小一点。
     * \n腰围是取被测者髂前上嵴和第十二肋下缘连线中点，水平位绕腹一周，皮尺应紧贴软组织，但不压迫，测量值精确到0.1cm。对于多数人讲，理想的腰围，男性应在85cm、女性应在80cm以下。 <\/p>\n\n
     *
     *<img src=\"/content/images/2017/03/4DA096D4751172EC3FD6BB55122707B6-2.jpg\" alt=\"\"></img>\n*腰围(WC)的重要性： 不同人群中，与腰围相关的疾病危险性不同。例如，南亚人(印度)的腹部脂肪相当高，腰围大，以WHO的BMI标准来判定时，他们并不肥胖，但是实际上，他们患肥胖相关疾病的危险性非常高。说明对亚太地区的人来说腰围在衡量肥胖相
     * 关疾病时是非常有用的指标。<\/em><\/p>\n\n*
     *
     ***腰围减少时，即使体重没有改变，也可明显减低肥胖相关疾病的危险性<\/strong><\/p>\n\n**
     *
     *腰臀比   腰臀比（Waist-hip Ratio, WHR）就是指腰围和臀围的比值。臀围反映髋部骨骼和肌肉的发育情况。测量
     * 臀围时，被测者两腿并拢直立，两臂自然下垂，皮尺水平放在前面的耻骨联合和背后臀大肌最凸处，环绕一圈即得臀围值（图1）。由于脂肪无论堆积在腰腹或内脏，都是难以直接测量的，所以，腰臀比和腰围一样就成了间接反映这类肥胖的最好指标之一。
     * 腰臀比值越大，腰腹或内脏就有可能堆积更多的脂肪。因此，腰臀比可预测心血管疾病、糖尿病和乳腺癌的发生危险。<\/p>\n\n
     *
     *理想的腰臀比例最小值应该是多少，目前还没有定论。但是，理想的腰臀比例最大值是多少，已经得到了众多专家的确认。如果是女性，理想的腰臀比例大约在0.67～0.80之间。
     * 如果是男性，这一比例大约在0.85～0.9之间。\n关注腰臀比例，能让你随时了解自己的健康状态，还可以给自己建立一个警戒线，是个很有效的健康指标。一旦腰臀比例过大，也就意味着健康风险的加大。糖尿病、高血压就会很容易找上门来；对于男人来说，还更容易患上心脏病。\n一般来讲，脂肪堆积在腰腹部
     * 比堆积在大腿和臀部，对身体的危害要大得多。腰腹部肥胖很容易导致糖尿病、高血压、冠心病、中风和高脂血症等疾病的发生，这就是人们常说的\u201c腰带长，寿命短\u201d的原因所在，因此说腰围臀围比是健康风向标，但是体重指数只能看作是对体重及相关健康隐患的粗略测算。
     * <\/p>\n\n
     *
     *<img src=\"/content/images/2017/03/ddd.png\" alt=\"\"></img><\/p>\n\n
     *
     *美国运动医学会（ACSM）在1997年提出，男性WHR>0.95或者女性WHR>0.86，都会加大某些疾病的风险，而和我们地缘更近的澳大利亚健康部提出，
     * 男性WHR>1或女性WHR>0.85则为高腰臀围比。目前，我国男性WHR≥0.9、女性WHR≥0.8即为异常。WHR是描述脂肪类型的指标，高者多为向心性脂肪分布，低者多为全身性脂肪分布。<\/p>\n\n
     *
     ***生理或医学意义<\/strong><\/p>\n\n**
     *
     *
     * 当男性WHR大于0.9，女性WHR大于0.8，可诊断为中心性肥胖。 但其分界值随年龄、性别、人种不同而异。<\/p>\n\n
     *
     *腰臀比是早期研究中预测肥胖的指标。比值越小，说明越健康。这是预测一个人是否肥胖及是否面临患心脏病风险的较佳方法，
     * 腰围尺寸大，表明脂肪存在于腹部，是危险较大的信号;而一个人臀围大，表明其下身肌肉发达，对人的健康有益。<\/p>\n\n
     *
     *全身胖的人相对健康一些，四肢纤细但拥有啤酒肚者最危险。从对血管、血脂和动脉闭塞的影响来看，累积在腰部的脂肪，
     * 比大腿和臀部脂肪对健康的影响更大。腰部脂肪会破坏胰岛素系统，而且腰部脂肪的新陈代谢相当快，还会产生不同的激素，导致糖尿病、高血压、高血脂等病症。另外，腰部脂肪还会导致肝肥大，使它无法发挥正常功能。
     * <\/p>\n\n
     *
     *<img src=\"/content/images/2017/03/fadfccd351e7729de2d15cc063c96f6f.jpg\" alt=\"\"></img><\/p>\n\n
     *
     *运动是减少脂肪的最佳方法，同时还可以增强下肢肌肉;而节食不能有效改变腰臀比。
     * <\/p>\n\n
     *
     *<img src=\"/content/images/2017/03/en-d-2.jpg\" alt=\"\"></img>\n<img src=\"/content/images/2017/03/--2.jpg\" alt=\"\"></img><\/p>",
     * "amp":null,
     * "image":"/content/images/2017/03/1482680113453537-1.jpg",
     * "featured":false,"page":false,
     * "status":"published",
     * "language":"en_US",
     * "visibility":"public",
     * "meta_title":null,
     * "meta_description":null,
     * "created_at":"2017-03-04T04:02:00.000Z",
     * "created_by":2,
     * "updated_at":"2017-03-04T04:39:40.000Z",
     * "updated_by":2,"published_at":"2017-03-04T04:39:40.000Z",
     * "published_by":2,
     * "author":2,
     * "url":"/fat-how/"}]
     * meta : {"pagination":{"page":1,"limit":10,"pages":1,"total":1,"next":null,"prev":null}}
     */

    var meta: MetaBean? = null
    var posts: List<PostsBean>? = null

    class MetaBean {
        /**
         * pagination : {"page":1,"limit":10,"pages":1,"total":1,"next":null,"prev":null}
         */

        var pagination: PaginationBean? = null

        class PaginationBean {
            /**
             * page : 1
             * limit : 10
             * pages : 1
             * total : 1
             * next : null
             * prev : null
             */

            var page: Int = 0
            var limit: Int = 0
            var pages: Int = 0
            var total: Int = 0
            var next: Any? = null
            var prev: Any? = null
        }
    }

    class PostsBean {
        /**
         * id : 19
         * uuid : 09aadcbc-a72b-49a1-a32f-48c64e276411
         * title : 你到底胖不胖？
         * slug : fat-how
         * markdown :
         * ![](/content/images/2017/03/-----2017-03-03---4.13.01.png)
         *
         *
         * 从体内脂肪角度说，还有一个分布的问题，腹部脂肪的堆积对人体有更多的危害，而臀部脂肪增加对健康的影响相对小一点。
         * 腰围是取被测者髂前上嵴和第十二肋下缘连线中点，水平位绕腹一周，皮尺应紧贴软组织，但不压迫，测量值精确到0.1cm。对于多数人讲，理想的腰围，男性应在85cm、女性应在80cm以下。
         *
         *
         * ![](/content/images/2017/03/4DA096D4751172EC3FD6BB55122707B6-2.jpg)
         * 腰围(WC)的重要性： 不同人群中，与腰围相关的疾病危险性不同。例如，南亚人(印度)的腹部脂肪相当高，腰围大，以WHO的BMI标准来判定时，他们并不肥胖，但是实际上，他们患肥胖相关疾病的危险性非常高。说明对亚太地区的人来说腰围在衡量肥胖相关疾病时是非常有用的指标。*
         *
         *
         * *腰围减少时，即使体重没有改变，也可明显减低肥胖相关疾病的危险性**
         *
         *
         * 腰臀比   腰臀比（Waist-hip Ratio, WHR）就是指腰围和臀围的比值。臀围反映髋部骨骼和肌肉的发育情况。测量臀围时，被测者两腿并拢直立，两臂自然下垂，皮尺水平放在前面的耻骨联合和背后臀大肌最凸处，环绕一圈即得臀围值（图1）。由于脂肪无论堆积在腰腹或内脏，都是难以直接测量的，所以，腰臀比和腰围一样就成了间接反映这类肥胖的最好指标之一。腰臀比值越大，腰腹或内脏就有可能堆积更多的脂肪。因此，腰臀比可预测心血管疾病、糖尿病和乳腺癌的发生危险。
         *
         *
         * 理想的腰臀比例最小值应该是多少，目前还没有定论。但是，理想的腰臀比例最大值是多少，已经得到了众多专家的确认。如果是女性，理想的腰臀比例大约在0.67～0.80之间。如果是男性，这一比例大约在0.85～0.9之间。
         * 关注腰臀比例，能让你随时了解自己的健康状态，还可以给自己建立一个警戒线，是个很有效的健康指标。一旦腰臀比例过大，也就意味着健康风险的加大。糖尿病、高血压就会很容易找上门来；对于男人来说，还更容易患上心脏病。
         * 一般来讲，脂肪堆积在腰腹部比堆积在大腿和臀部，对身体的危害要大得多。腰腹部肥胖很容易导致糖尿病、高血压、冠心病、中风和高脂血症等疾病的发生，这就是人们常说的“腰带长，寿命短”的原因所在，因此说腰围臀围比是健康风向标，但是体重指数只能看作是对体重及相关健康隐患的粗略测算。
         *
         *
         * ![](/content/images/2017/03/ddd.png)
         *
         *
         * 美国运动医学会（ACSM）在1997年提出，男性WHR>0.95或者女性WHR>0.86，都会加大某些疾病的风险，而和我们地缘更近的澳大利亚健康部提出，男性WHR>1或女性WHR>0.85则为高腰臀围比。目前，我国男性WHR≥0.9、女性WHR≥0.8即为异常。WHR是描述脂肪类型的指标，高者多为向心性脂肪分布，低者多为全身性脂肪分布。
         *
         *
         * *生理或医学意义**
         *
         *
         * 当男性WHR大于0.9，女性WHR大于0.8，可诊断为中心性肥胖。 但其分界值随年龄、性别、人种不同而异。
         *
         *
         * 腰臀比是早期研究中预测肥胖的指标。比值越小，说明越健康。这是预测一个人是否肥胖及是否面临患心脏病风险的较佳方法，腰围尺寸大，表明脂肪存在于腹部，是危险较大的信号;而一个人臀围大，表明其下身肌肉发达，对人的健康有益。
         *
         *
         * 全身胖的人相对健康一些，四肢纤细但拥有啤酒肚者最危险。从对血管、血脂和动脉闭塞的影响来看，累积在腰部的脂肪，比大腿和臀部脂肪对健康的影响更大。腰部脂肪会破坏胰岛素系统，而且腰部脂肪的新陈代谢相当快，还会产生不同的激素，导致糖尿病、高血压、高血脂等病症。另外，腰部脂肪还会导致肝肥大，使它无法发挥正常功能。
         *
         *
         * ![](/content/images/2017/03/fadfccd351e7729de2d15cc063c96f6f.jpg)
         *
         *
         * 运动是减少脂肪的最佳方法，同时还可以增强下肢肌肉;而节食不能有效改变腰臀比。
         *
         *
         * ![](/content/images/2017/03/en-d-2.jpg)
         * ![](/content/images/2017/03/--2.jpg)
         *
         *
         * mobiledoc : null
         * html :
         *
         *<img src="/content/images/2017/03/-----2017-03-03---4.13.01.png" alt=""></img>
         *
         *
         *
         * 从体内脂肪角度说，还有一个分布的问题，腹部脂肪的堆积对人体有更多的危害，而臀部脂肪增加对健康的影响相对小一点。
         * 腰围是取被测者髂前上嵴和第十二肋下缘连线中点，水平位绕腹一周，皮尺应紧贴软组织，但不压迫，测量值精确到0.1cm。对于多数人讲，理想的腰围，男性应在85cm、女性应在80cm以下。
         *
         *
         *
         * <img src="/content/images/2017/03/4DA096D4751172EC3FD6BB55122707B6-2.jpg" alt=""></img>
         * *腰围(WC)的重要性： 不同人群中，与腰围相关的疾病危险性不同。例如，南亚人(印度)的腹部脂肪相当高，腰围大，以WHO的BMI标准来判定时，他们并不肥胖，但是实际上，他们患肥胖相关疾病的危险性非常高。说明对亚太地区的人来说腰围在衡量肥胖相关疾病时是非常有用的指标。*
         *
         *
         *
         * **腰围减少时，即使体重没有改变，也可明显减低肥胖相关疾病的危险性**
         *
         *
         *
         * 腰臀比   腰臀比（Waist-hip Ratio, WHR）就是指腰围和臀围的比值。臀围反映髋部骨骼和肌肉的发育情况。测量臀围时，被测者两腿并拢直立，两臂自然下垂，皮尺水平放在前面的耻骨联合和背后臀大肌最凸处，环绕一圈即得臀围值（图1）。由于脂肪无论堆积在腰腹或内脏，都是难以直接测量的，所以，腰臀比和腰围一样就成了间接反映这类肥胖的最好指标之一。腰臀比值越大，腰腹或内脏就有可能堆积更多的脂肪。因此，腰臀比可预测心血管疾病、糖尿病和乳腺癌的发生危险。
         *
         *
         *
         * 理想的腰臀比例最小值应该是多少，目前还没有定论。但是，理想的腰臀比例最大值是多少，已经得到了众多专家的确认。如果是女性，理想的腰臀比例大约在0.67～0.80之间。如果是男性，这一比例大约在0.85～0.9之间。
         * 关注腰臀比例，能让你随时了解自己的健康状态，还可以给自己建立一个警戒线，是个很有效的健康指标。一旦腰臀比例过大，也就意味着健康风险的加大。糖尿病、高血压就会很容易找上门来；对于男人来说，还更容易患上心脏病。
         * 一般来讲，脂肪堆积在腰腹部比堆积在大腿和臀部，对身体的危害要大得多。腰腹部肥胖很容易导致糖尿病、高血压、冠心病、中风和高脂血症等疾病的发生，这就是人们常说的“腰带长，寿命短”的原因所在，因此说腰围臀围比是健康风向标，但是体重指数只能看作是对体重及相关健康隐患的粗略测算。
         *
         *
         *
         * <img src="/content/images/2017/03/ddd.png" alt=""></img>
         *
         *
         *
         * 美国运动医学会（ACSM）在1997年提出，男性WHR>0.95或者女性WHR>0.86，都会加大某些疾病的风险，而和我们地缘更近的澳大利亚健康部提出，男性WHR>1或女性WHR>0.85则为高腰臀围比。目前，我国男性WHR≥0.9、女性WHR≥0.8即为异常。WHR是描述脂肪类型的指标，高者多为向心性脂肪分布，低者多为全身性脂肪分布。
         *
         *
         *
         * **生理或医学意义**
         *
         *
         *
         * 当男性WHR大于0.9，女性WHR大于0.8，可诊断为中心性肥胖。 但其分界值随年龄、性别、人种不同而异。
         *
         *
         *
         * 腰臀比是早期研究中预测肥胖的指标。比值越小，说明越健康。这是预测一个人是否肥胖及是否面临患心脏病风险的较佳方法，腰围尺寸大，表明脂肪存在于腹部，是危险较大的信号;而一个人臀围大，表明其下身肌肉发达，对人的健康有益。
         *
         *
         *
         * 全身胖的人相对健康一些，四肢纤细但拥有啤酒肚者最危险。从对血管、血脂和动脉闭塞的影响来看，累积在腰部的脂肪，比大腿和臀部脂肪对健康的影响更大。腰部脂肪会破坏胰岛素系统，而且腰部脂肪的新陈代谢相当快，还会产生不同的激素，导致糖尿病、高血压、高血脂等病症。另外，腰部脂肪还会导致肝肥大，使它无法发挥正常功能。
         *
         *
         *
         * <img src="/content/images/2017/03/fadfccd351e7729de2d15cc063c96f6f.jpg" alt=""></img>
         *
         *
         *
         * 运动是减少脂肪的最佳方法，同时还可以增强下肢肌肉;而节食不能有效改变腰臀比。
         *
         *
         *
         * <img src="/content/images/2017/03/en-d-2.jpg" alt=""></img>
         * <img src="/content/images/2017/03/--2.jpg" alt=""></img>
         * amp : null
         * image : /content/images/2017/03/1482680113453537-1.jpg
         * featured : false
         * page : false
         * status : published
         * language : en_US
         * visibility : public
         * meta_title : null
         * meta_description : null
         * created_at : 2017-03-04T04:02:00.000Z
         * created_by : 2
         * updated_at : 2017-03-04T04:39:40.000Z
         * updated_by : 2
         * published_at : 2017-03-04T04:39:40.000Z
         * published_by : 2
         * author : 2
         * url : /fat-how/
         */

        var id: Int = 0
        var uuid: String? = null
        var title: String? = null
        var slug: String? = null
        var markdown: String? = null
        var mobiledoc: Any? = null
        var html: String? = null
        var amp: Any? = null
        var image: String? = null
        var isFeatured: Boolean = false
        var isPage: Boolean = false
        var status: String? = null
        var language: String? = null
        var visibility: String? = null
        var meta_title: Any? = null
        var meta_description: Any? = null
        var created_at: String? = null
        var created_by: Int = 0
        var updated_at: String? = null
        var updated_by: Int = 0
        var published_at: String? = null
        var published_by: Int = 0
        var author: Int = 0
        var url: String? = null
    }

}